espressif/arduino-esp32/boards.txt
espino32.menu.UploadSpeed.921600=921600
espino32.menu.UploadSpeed.921600.upload.speed=921600
espino32.menu.UploadSpeed.115200=115200
espino32.menu.UploadSpeed.115200.upload.speed=115200
espino32.menu.UploadSpeed.256000.windows=256000
espino32.menu.UploadSpeed.256000.upload.speed=256000
espino32.menu.UploadSpeed.230400.windows.upload.speed=256000
espino32.menu.UploadSpeed.230400=230400
espino32.menu.UploadSpeed.230400.upload.speed=230400
espino32.menu.UploadSpeed.460800.linux=460800
espino32.menu.UploadSpeed.460800.macosx=460800
espino32.menu.UploadSpeed.460800.upload.speed=460800
espino32.menu.UploadSpeed.512000.windows=512000
espino32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

m5stack-core-esp32.name=M5Stack-Core-ESP32

m5stack-core-esp32.upload.tool=esptool
m5stack-core-esp32.upload.maximum_size=1310720
m5stack-core-esp32.upload.maximum_data_size=294912
m5stack-core-esp32.upload.wait_for_upload_port=true

m5stack-core-esp32.serial.disableDTR=true
m5stack-core-esp32.serial.disableRTS=true

m5stack-core-esp32.build.mcu=esp32
m5stack-core-esp32.build.core=esp32
m5stack-core-esp32.build.variant=m5stack_core_esp32
m5stack-core-esp32.build.board=M5Stack_Core_ESP32

m5stack-core-esp32.build.f_cpu=240000000L
m5stack-core-esp32.build.flash_size=4MB
m5stack-core-esp32.build.flash_mode=dio
m5stack-core-esp32.build.boot=dio
m5stack-core-esp32.build.partitions=default

m5stack-core-esp32.menu.FlashMode.qio=QIO
m5stack-core-esp32.menu.FlashMode.qio.build.flash_mode=dio
m5stack-core-esp32.menu.FlashMode.qio.build.boot=qio
m5stack-core-esp32.menu.FlashMode.dio=DIO
m5stack-core-esp32.menu.FlashMode.dio.build.flash_mode=dio
m5stack-core-esp32.menu.FlashMode.dio.build.boot=dio
m5stack-core-esp32.menu.FlashMode.qout=QOUT
m5stack-core-esp32.menu.FlashMode.qout.build.flash_mode=dout
m5stack-core-esp32.menu.FlashMode.qout.build.boot=qout
m5stack-core-esp32.menu.FlashMode.dout=DOUT
m5stack-core-esp32.menu.FlashMode.dout.build.flash_mode=dout
m5stack-core-esp32.menu.FlashMode.dout.build.boot=dout

m5stack-core-esp32.menu.FlashFreq.80=80MHz
m5stack-core-esp32.menu.FlashFreq.80.build.flash_freq=80m
m5stack-core-esp32.menu.FlashFreq.40=40MHz
m5stack-core-esp32.menu.FlashFreq.40.build.flash_freq=40m

m5stack-core-esp32.menu.PartitionScheme.default=Default
m5stack-core-esp32.menu.PartitionScheme.default.build.partitions=default
m5stack-core-esp32.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-core-esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-core-esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-core-esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-core-esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-core-esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-core-esp32.menu.UploadSpeed.921600=921600
m5stack-core-esp32.menu.UploadSpeed.921600.upload.speed=921600
m5stack-core-esp32.menu.UploadSpeed.115200=115200
m5stack-core-esp32.menu.UploadSpeed.115200.upload.speed=115200
m5stack-core-esp32.menu.UploadSpeed.256000.windows=256000
m5stack-core-esp32.menu.UploadSpeed.256000.upload.speed=256000
m5stack-core-esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-core-esp32.menu.UploadSpeed.230400=230400
m5stack-core-esp32.menu.UploadSpeed.230400.upload.speed=230400
m5stack-core-esp32.menu.UploadSpeed.460800.linux=460800
m5stack-core-esp32.menu.UploadSpeed.460800.macosx=460800
m5stack-core-esp32.menu.UploadSpeed.460800.upload.speed=460800
m5stack-core-esp32.menu.UploadSpeed.512000.windows=512000
m5stack-core-esp32.menu.UploadSpeed.512000.upload.speed=512000

m5stack-core-esp32.menu.DebugLevel.none=None
m5stack-core-esp32.menu.DebugLevel.none.build.code_debug=0
m5stack-core-esp32.menu.DebugLevel.error=Error
m5stack-core-esp32.menu.DebugLevel.error.build.code_debug=1
m5stack-core-esp32.menu.DebugLevel.warn=Warn
m5stack-core-esp32.menu.DebugLevel.warn.build.code_debug=2
m5stack-core-esp32.menu.DebugLevel.info=Info
m5stack-core-esp32.menu.DebugLevel.info.build.code_debug=3
m5stack-core-esp32.menu.DebugLevel.debug=Debug
m5stack-core-esp32.menu.DebugLevel.debug.build.code_debug=4
m5stack-core-esp32.menu.DebugLevel.verbose=Verbose
m5stack-core-esp32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

heltec_wifi_kit_32.name=Heltec_WIFI_Kit_32

heltec_wifi_kit_32.upload.tool=esptool
heltec_wifi_kit_32.upload.maximum_size=1310720
heltec_wifi_kit_32.upload.maximum_data_size=294912
heltec_wifi_kit_32.upload.wait_for_upload_port=true

heltec_wifi_kit_32.serial.disableDTR=true
heltec_wifi_kit_32.serial.disableRTS=true

heltec_wifi_kit_32.build.mcu=esp32
heltec_wifi_kit_32.build.core=esp32
heltec_wifi_kit_32.build.variant=heltec_wifi_kit_32
heltec_wifi_kit_32.build.board=Heltec_WIFI_Kit_32

heltec_wifi_kit_32.build.f_cpu=240000000L
heltec_wifi_kit_32.build.flash_mode=dio
heltec_wifi_kit_32.build.flash_size=4MB
heltec_wifi_kit_32.build.boot=dio
heltec_wifi_kit_32.build.partitions=default

heltec_wifi_kit_32.menu.FlashFreq.80=80MHz
heltec_wifi_kit_32.menu.FlashFreq.80.build.flash_freq=80m
heltec_wifi_kit_32.menu.FlashFreq.40=40MHz
heltec_wifi_kit_32.menu.FlashFreq.40.build.flash_freq=40m

heltec_wifi_kit_32.menu.UploadSpeed.921600=921600
heltec_wifi_kit_32.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_kit_32.menu.UploadSpeed.115200=115200
heltec_wifi_kit_32.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_kit_32.menu.UploadSpeed.256000.windows=256000
heltec_wifi_kit_32.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400=230400
heltec_wifi_kit_32.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_kit_32.menu.UploadSpeed.460800.linux=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_kit_32.menu.UploadSpeed.512000.windows=512000
heltec_wifi_kit_32.menu.UploadSpeed.512000.upload.speed=512000

