espressif/arduino-esp32/boards.txt
##############################################################

heltec_wifi_lora_32.name=Heltec_WIFI_LoRa_32

heltec_wifi_lora_32.upload.tool=esptool
heltec_wifi_lora_32.upload.maximum_size=1310720
heltec_wifi_lora_32.upload.maximum_data_size=294912
heltec_wifi_lora_32.upload.wait_for_upload_port=true

heltec_wifi_lora_32.serial.disableDTR=true
heltec_wifi_lora_32.serial.disableRTS=true

heltec_wifi_lora_32.build.mcu=esp32
heltec_wifi_lora_32.build.core=esp32
heltec_wifi_lora_32.build.variant=heltec_wifi_lora_32
heltec_wifi_lora_32.build.board=Heltec_WIFI_LoRa_32

heltec_wifi_lora_32.build.f_cpu=240000000L
heltec_wifi_lora_32.build.flash_mode=dio
heltec_wifi_lora_32.build.flash_size=4MB
heltec_wifi_lora_32.build.boot=dio
heltec_wifi_lora_32.build.partitions=default

heltec_wifi_lora_32.menu.FlashFreq.80=80MHz
heltec_wifi_lora_32.menu.FlashFreq.80.build.flash_freq=80m
heltec_wifi_lora_32.menu.FlashFreq.40=40MHz
heltec_wifi_lora_32.menu.FlashFreq.40.build.flash_freq=40m

heltec_wifi_lora_32.menu.UploadSpeed.921600=921600
heltec_wifi_lora_32.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_lora_32.menu.UploadSpeed.115200=115200
heltec_wifi_lora_32.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_lora_32.menu.UploadSpeed.256000.windows=256000
heltec_wifi_lora_32.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_lora_32.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_lora_32.menu.UploadSpeed.230400=230400
heltec_wifi_lora_32.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_lora_32.menu.UploadSpeed.460800.linux=460800
heltec_wifi_lora_32.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_lora_32.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_lora_32.menu.UploadSpeed.512000.windows=512000
heltec_wifi_lora_32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

espectro32.name=ESPectro32

espectro32.upload.tool=esptool
espectro32.upload.maximum_size=1310720
espectro32.upload.maximum_data_size=294912
espectro32.upload.wait_for_upload_port=true

espectro32.serial.disableDTR=true
espectro32.serial.disableRTS=true

espectro32.build.mcu=esp32
espectro32.build.core=esp32
espectro32.build.variant=espectro32
espectro32.build.board=ESPECTRO32

espectro32.build.f_cpu=240000000L
espectro32.build.flash_size=4MB
espectro32.build.flash_mode=dio
espectro32.build.boot=dio
espectro32.build.partitions=default

espectro32.menu.FlashMode.qio=QIO
espectro32.menu.FlashMode.qio.build.flash_mode=dio
espectro32.menu.FlashMode.qio.build.boot=qio
espectro32.menu.FlashMode.dio=DIO
espectro32.menu.FlashMode.dio.build.flash_mode=dio
espectro32.menu.FlashMode.dio.build.boot=dio
espectro32.menu.FlashMode.qout=QOUT
espectro32.menu.FlashMode.qout.build.flash_mode=dout
espectro32.menu.FlashMode.qout.build.boot=qout
espectro32.menu.FlashMode.dout=DOUT
espectro32.menu.FlashMode.dout.build.flash_mode=dout
espectro32.menu.FlashMode.dout.build.boot=dout

espectro32.menu.FlashFreq.80=80MHz
espectro32.menu.FlashFreq.80.build.flash_freq=80m
espectro32.menu.FlashFreq.40=40MHz
espectro32.menu.FlashFreq.40.build.flash_freq=40m

espectro32.menu.FlashSize.4M=4MB (32Mb)
espectro32.menu.FlashSize.4M.build.flash_size=4MB
espectro32.menu.FlashSize.2M=2MB (16Mb)
espectro32.menu.FlashSize.2M.build.flash_size=2MB
espectro32.menu.FlashSize.2M.build.partitions=minimal

espectro32.menu.UploadSpeed.921600=921600
espectro32.menu.UploadSpeed.921600.upload.speed=921600
espectro32.menu.UploadSpeed.115200=115200
espectro32.menu.UploadSpeed.115200.upload.speed=115200
espectro32.menu.UploadSpeed.256000.windows=256000
espectro32.menu.UploadSpeed.256000.upload.speed=256000
espectro32.menu.UploadSpeed.230400.windows.upload.speed=256000
espectro32.menu.UploadSpeed.230400=230400
espectro32.menu.UploadSpeed.230400.upload.speed=230400
espectro32.menu.UploadSpeed.460800.linux=460800
espectro32.menu.UploadSpeed.460800.macosx=460800
espectro32.menu.UploadSpeed.460800.upload.speed=460800
espectro32.menu.UploadSpeed.512000.windows=512000
espectro32.menu.UploadSpeed.512000.upload.speed=512000

espectro32.menu.DebugLevel.none=None
espectro32.menu.DebugLevel.none.build.code_debug=0
espectro32.menu.DebugLevel.error=Error
espectro32.menu.DebugLevel.error.build.code_debug=1
espectro32.menu.DebugLevel.warn=Warn
espectro32.menu.DebugLevel.warn.build.code_debug=2
espectro32.menu.DebugLevel.info=Info
espectro32.menu.DebugLevel.info.build.code_debug=3
espectro32.menu.DebugLevel.debug=Debug
espectro32.menu.DebugLevel.debug.build.code_debug=4
espectro32.menu.DebugLevel.verbose=Verbose
espectro32.menu.DebugLevel.verbose.build.code_debug=5


##############################################################
CoreESP32.name=Microduino-CoreESP32

CoreESP32.upload.tool=esptool
CoreESP32.upload.maximum_size=1310720
CoreESP32.upload.maximum_data_size=294912
CoreESP32.upload.wait_for_upload_port=true

CoreESP32.serial.disableDTR=true
CoreESP32.serial.disableRTS=true

CoreESP32.build.mcu=esp32
CoreESP32.build.core=esp32
CoreESP32.build.variant=Microduino-esp32
CoreESP32.build.board=CoreESP32

CoreESP32.build.f_cpu=240000000L
CoreESP32.build.flash_mode=dio
CoreESP32.build.flash_size=4MB
CoreESP32.build.boot=dio
CoreESP32.build.partitions=default

CoreESP32.menu.FlashFreq.80=80MHz
CoreESP32.menu.FlashFreq.80.build.flash_freq=80m
CoreESP32.menu.FlashFreq.40=40MHz
CoreESP32.menu.FlashFreq.40.build.flash_freq=40m

CoreESP32.menu.UploadSpeed.921600=921600
CoreESP32.menu.UploadSpeed.921600.upload.speed=921600
CoreESP32.menu.UploadSpeed.115200=115200
CoreESP32.menu.UploadSpeed.115200.upload.speed=115200
CoreESP32.menu.UploadSpeed.256000.windows=256000
CoreESP32.menu.UploadSpeed.256000.upload.speed=256000
CoreESP32.menu.UploadSpeed.230400.windows.upload.speed=256000
CoreESP32.menu.UploadSpeed.230400=230400
CoreESP32.menu.UploadSpeed.230400.upload.speed=230400
CoreESP32.menu.UploadSpeed.460800.linux=460800
CoreESP32.menu.UploadSpeed.460800.macosx=460800
CoreESP32.menu.UploadSpeed.460800.upload.speed=460800
CoreESP32.menu.UploadSpeed.512000.windows=512000
CoreESP32.menu.UploadSpeed.512000.upload.speed=512000
